#База на вывод данных
print ("Hello World!")
print("Hello Git")

#1 PYTHON CORE 2.0
# 1.1 Синтаксис, змінні, типи даних, оператори

# Введення (отримання даних)
name = input("Введіть ваше ім'я: ").strip()

banned_names = ["хуйло", "дурак", "идиот", "еблан", "животное"]

if name.lower() in banned_names:
    print("Доброго вечора, ми з України")
else:
    print(f"Привіт, {name}!")


#Змінна
age = 20
user_name = "Boris"
user_age = 30
ADULT_THR = 18

#Наступна змінна user_name представляє ім'я користувача та отримує значення рядка "Boris". Змінна user_name тепер вказує на область пам'яті, де зберігається рядок "Boris". 
#Це як етикетка на коробку, щоб краще розуміти, що в ній зберігається. Подивись на малюнок нижче для кращого розуміння процесу зберігання значень у змінних.


#комплексные числа
int_number = 3
float_number = 3.3
complex_number = 3.3 + 2j


#логический тип данных
is_active = True
is_delete = False


age = 18
is_adult = age >= 18  # True

age = 15
is_adult = age >= 18  # False

# Логічний (булевий) тип у Python, відомий як bool, є основним типом даних, який використовується для представлення істинності або хибності. Цей тип даних має лише два можливі значення: True or False



#F-рядок — це такий шаблон, який дозволяє зручним чином генерувати рядок, підставляючи результат виконання виразів у потрібне місце в шаблоні.

#легкая конструкция f-предл
name = "Andrii"
hello_string = f"Hello, {name}!" # имя Андрей находит

#сложная конструкция f-предл
s1 = "Hello"
s2 = "world!"
joined_string = s1 + " " + s2

s1 = 'Hello'
s2 = 'world!'
joined_string = f"{s1} {s2}"   # Hello world получается!



# ТИП NONE - Python використовується для позначення відсутності значення або "нічого"
connect_to_database = None

#Інструкція (statement) — це пов'язаний набір слів і символів із синтаксису мови, які об'єднуються, щоб виразити одну ідею, одну інструкцію для машини.
#У Python інструкція — це мінімальна одиниця вираження, яку інтерпретатор може виконати. Іншими словами, інструкція — це один із кроків, які вказують програмі, що робити. 
#Це може бути проста команда, як присвоєння значення змінній, або складніша структура.
x = 2
y = x + 10

a = 1
b = 2
c = a + b + 10

#У Python вираз (expression) — це комбінація значень, змінних, операторів та викликів функцій, які інтерпретатор обчислює ("виконує") для отримання якогось результату. 
#Вирази завжди щось повертають. Іншими словами, кожного разу, коли Python обчислює вираз, він повертає або виводить яке-небудь значення.

a = 1
b = 2
c = a + b + 10

#ОПЕРАТОРИ ТА ОПЕРАНДИ

#Операнд — це об'єкт, який маніпулюється оператором. Це може бути змінна, літерал (наприклад, число або рядок) або більш складний вираз. 
#Наприклад, у виразі 5 + 3 5 і 3 є операндами.

#Оператор — це символ або ключове слово, яке застосовується до операндів і виконує певну операцію. Вищезгаданий символ + є оператором додавання. 
#Оператори можуть бути різних видів: арифметичні, порівняння, логічні тощо.

side_a = 10
side_b = 5

hypotenuse = (side_a**2 + side_b**2)**0.5
hypotenuse = 11.180339887498949



S = side_a * side_b / 2
S = 25 #Після розрахунку змінна S буде дорівнювати 25.0. Зверни увагу, що змінна S стала типу float, хоча в правій стороні виразу стоять тільки числа int. Так завжди буває при операціях ділення.
#Щоб отримати тільки цілу частину, треба використовувати операцію ділення без остачі //

n = 5000

hours = n // (60 * 60)
minutes = (n - hours * 60 * 60) // 60
seconds = n - hours * 60 * 60 - minutes * 60

#Цей фрагмент коду призначений для обчислення кількості годин, хвилин і секунд у заданій кількості секунд n. Це корисно, наприклад, для перетворення секунд у більш звичний формат часу.
#Спочатку ми привласнюємо змінній n початкове значення 5000, це називається ініціалізація змінної. Число 5000 представляє загальну кількість секунд, які потрібно розбити на години, хвилини та секунди. 
#Далі в нас іде інструкція hours = n // (60 * 60). Тут використовується цілочисельне ділення // для обчислення кількості повних годин у загальній кількості секунд. Оскільки одна година має 60 хвилин, 
#а кожна хвилина має 60 секунд, множимо 60 на 60, щоб отримати кількість секунд в одній годині. Потім ділимо n на це число, щоб отримати кількість повних годин, у нашому випадку це 1 година.
#Після обчислення годин знімаємо ці години із загальної кількості секунд n - hours * 60 * 60 і обчислюємо, скільки повних хвилин залишилося. Це робиться шляхом ділення залишку на 60 (кількість секунд в одній хвилині). 
#Отже, вираз minutes = (n - hours * 60 * 60) // 60 поверне нам 23.
#Нарешті, обчислюємо кількість секунд, які залишилися після вилучення годин і хвилин із загальної кількості seconds = n - hours * 60 * 60 - minutes * 60. 
#Це різниця між загальною кількістю секунд і кількістю секунд, які утворюють повні години та хвилини, у нас повинно бути 20 секунд.


#ОПЕРАТОР ВЗЯТТЯ
#Оператор взяття ділить одне число на інше і повертає залишок від цього ділення.

#10 % 3 поверне 1, оскільки 10 ділиться на 3 три рази із залишком 1.
#5 % 4 поверне 3, бо 15 ділиться на 4 три рази із залишком 3.
#7 % 5 поверне 2, оскільки 7 ділиться на 5 один раз із залишком 2.

#Цей оператор часто використовується для перевірки на кратність, наприклад, визначаючи, є число парним чи непарним:
#Якщо x % 2 дорівнює 0, тоді x є парним.
#Якщо x % 2 дорівнює 1, тоді x є непарним.


#ПОРЯДОК ВИКОНАННЯ ОПЕРАЦІЙ У ВИРАЗІ
#Математичні операції виконуються по черзі, залежно від їхнього пріоритету (якщо не задати іншу черговість за допомогою дужок). 
#Множення та ділення мають вищий пріоритет, ніж додавання та віднімання.

ratio = 10
result = 8 * (ratio + 5) - ratio ** 2

#Якщо виникає подвійна ситуація при читанні виразу, намагайтеся їх групувати разом за допомогою дужок. 
#Візьмемо, наприклад, зведення у степінь негативного числа -3 і зведемо його у квадрат. На папері ми вчинили б саме так:

-3 ** 2  # -9

#Ми отримаємо -9, але це швидше за все не той результат, який ми очікували. А річ у тім, що в Python пріоритет операції зведення в степінь вищий за заперечення. 
#Тому беремо -3 у дужки та отримуємо очікуваний результат.

(-3) ** 2  # 9

#Порядок виконання операцій у виразі в Python визначає, які операції будуть виконуватися першими у складних виразах, що містять різні види операцій. 
#Цей порядок схожий на стандартний математичний порядок операцій, який використовується в більшості мов програмування.

#Перерахуємо основні правила застосування операцій у порядку їх пріоритету:

#Дужки (): Вирази всередині дужок мають найвищий пріоритет і виконуються першими. Дужки можуть бути використані для зміни звичайного порядку виконання.
#Піднесення до степеня **: Наступним виконується піднесення до степеня.
#Унарні плюс + та мінус -. Далі йдуть операції унарного плюса та мінуса (наприклад, -5 або +3).
#Множення *, ділення /, цілочисельне ділення //, остача від ділення %: Ці операції мають однаковий пріоритет і виконуються після унарних операцій.
#Додавання + та віднімання -. Виконуються після операцій множення та ділення.
#Операції порівняння ==, !=, >, <, >=, <=: Виконуються після арифметичних операцій.
#Логічні операції not, and, or: В кінці виконуються логічні операції, де not має вищий пріоритет, ніж and, який, у свою чергу, має вищий пріоритет, ніж or.


